#include <stdio.h>

int main() {
    int A[10][3] = {
        {1,2,3},
        {4,5,6},
        {7,8,9},
        {1,2,3},
        {4,5,6},
        {7,8,9},
        {1,2,3},
        {4,5,6},
        {7,8,9},
        {10, 11, 12}
    };
    int B[3][10] = {
        {1,2,3,4,5,6,7,8,9,10},
        {11,2,3,4,5,6,7,1,2,4},
        {4,5,6,7,8,9,0,1,2,3}
    };
    int C[10][10] = {0};

    for (int i = 0; i < 10; i++) {
        for (int j = 0; j < 10; j++) {
            C[i][j] = 0;
            for (int k = 0; k < 3; k++) {
                C[i][j] += A[i][k] * B[k][j];
            }
        }
    }

    printf("Результат умножения матриц (10x10):\n");
    for (int i = 0; i < 10; i++) {
        for (int j = 0; j < 10; j++) {
            printf("%4d ", C[i][j]);
        }
        printf("\n");
    }

    return 0;
}